{
  "backend/main.mo": "Motoko actor defining a contact form backend with submitContactForm, getAllSubmissions, and clearSubmissions methods, storing ContactSubmission records with name, email, messageType, message, and sender Principal.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: Navigation color scheme change to forest green, route reordering in App.tsx, and PollutionMap extension to worldwide coverage.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend files including pages, components, hooks, and configuration files for the Verdant Horizons plastic pollution awareness application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color tokens using OKLCH color space for backgrounds, foregrounds, borders, and component states.",
  "frontend/index.html": "HTML entry point for the Verdant Horizons application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with five routes (home, about, map, quiz, contact) wrapped in ThemeProvider and including Toaster for notifications.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation, name/email/messageType/message fields, backend integration via useActor hook, toast notifications, and ocean-500 submit button styling.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, mission statement, current year, and caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing consistent structure with Navigation header, main content area with Outlet, and Footer across all pages.",
  "frontend/src/components/Logo.tsx": "Logo component rendering the Verdant Horizons logo image as a Link to homepage with hover opacity transition.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation with forest green color scheme, Logo, desktop nav links (Home, About, Map, Quiz, Contact), mobile Sheet menu, and active route highlighting.",
  "frontend/src/components/PollutionMap.tsx": "React component that renders an interactive world map showing pollution levels by country with color-coded regions (very-high to very-low) and MWI scores. Allows users to select regions and displays country-specific pollution data.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login/logout state and identity persistence. Exports InternetIdentityProvider component and useInternetIdentity hook for accessing auth state throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions: useSubmitContactForm mutation for submitting contact forms and useGetAllSubmissions query for fetching all submissions. Both hooks depend on the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom ocean blue and forest green color palettes defined as CSS variables for both light and dark themes. Includes base styles for consistent theming across the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component. Wraps the app with necessary context providers for state management and authentication.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying Verdant Horizons' mission, values, and goals related to plastic pollution awareness. Features gradient headers, mission cards with icons, and information about education, engagement, and community action.",
  "frontend/src/pages/ContactPage.tsx": "Contact page component with a form for user inquiries and three informational cards describing contact purposes (general inquiries, feedback, information requests). Uses ocean and forest themed styling consistent with the app's design system.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component featuring a hero section with ocean imagery, statistics cards about plastic pollution (8M tons/year, 700+ species affected, 9% recycled), and call-to-action buttons linking to the map and about pages.",
  "frontend/src/pages/InteractiveMapPage.tsx": "Interactive map page displaying global plastic pollution hotspots with clickable regions (Pacific, Atlantic, Indian, Mediterranean, Caribbean) that show detailed pollution data and severity levels in a side panel.",
  "frontend/src/pages/QuizPage.tsx": "Educational quiz component with 7 questions about ocean plastic pollution, featuring progress tracking, immediate feedback with explanations, score calculation, and a retake option upon completion.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (ocean and forest themes with 50-950 shades using OKLCH), design tokens for UI components, container settings, and plugin integrations for typography, animations, and container queries.",
  "project_state.json": "Project metadata tracking three feature requests: changing navigation to green forest palette colors, reordering routes to place About after Home, and extending the PollutionMap to include all countries worldwide with proper SVG rendering."
}